(dlv) exit
(dlv) continue
> [unrecovered-panic] runtime.fatalpanic() /usr/local/go/src/runtime/panic.go:1065 (hits goroutine(1):1 total:1) (PC: 0x435080)
Warning: debugging optimized function
	runtime.curg._panic.arg: interface {}(string) "runtime error: index out of range [1] with length 1"
  1060:	// fatalpanic implements an unrecoverable panic. It is like fatalthrow, except
  1061:	// that if msgs != nil, fatalpanic also prints panic messages and decrements
  1062:	// runningPanicDefers once main is blocked from exiting.
  1063:	//
  1064:	//go:nosplit
=>1065:	func fatalpanic(msgs *_panic) {
  1066:		pc := getcallerpc()
  1067:		sp := getcallersp()
  1068:		gp := getg()
  1069:		var docrash bool
  1070:		// Switch to the system stack to avoid any stack growth, which
(dlv) stack
0  0x0000000000435080 in runtime.fatalpanic
   at /usr/local/go/src/runtime/panic.go:1065
1  0x00000000004348da in runtime.gopanic
   at /usr/local/go/src/runtime/panic.go:941
2  0x0000000000432aff in runtime.goPanicIndex
   at /usr/local/go/src/runtime/panic.go:89
3  0x000000000049859a in main.main
   at ./last-character.go:11
4  0x00000000004373b8 in runtime.main
   at /usr/local/go/src/runtime/proc.go:250
5  0x00000000004614e1 in runtime.goexit
   at /usr/local/go/src/runtime/asm_amd64.s:1571
(dlv) break last-character.go:11
Breakpoint 1 set at 0x4984c5 for main.main() ./last-character.go:11
(dlv) restart
Process restarted with PID 1904466
(dlv) continue
> main.main() ./last-character.go:11 (hits goroutine(1):1 total:1) (PC: 0x4984c5)
     6:	)
     7:	
     8:	func main() {
     9:		fmt.Println("Hello Gophers! Pass me a word and I will print the last character!")
    10:	
=>  11:		arg := os.Args[1]
    12:	
    13:		fmt.Printf("The last character in that word is: %c\n", arg[len(arg)])
    14:	}
(dlv) next
> [unrecovered-panic] runtime.fatalpanic() /usr/local/go/src/runtime/panic.go:1065 (hits goroutine(1):1 total:1) (PC: 0x435080)
Warning: debugging optimized function
	runtime.curg._panic.arg: interface {}(string) "runtime error: index out of range [1] with length 1"
  1060:	// fatalpanic implements an unrecoverable panic. It is like fatalthrow, except
  1061:	// that if msgs != nil, fatalpanic also prints panic messages and decrements
  1062:	// runningPanicDefers once main is blocked from exiting.
  1063:	//
  1064:	//go:nosplit
=>1065:	func fatalpanic(msgs *_panic) {
  1066:		pc := getcallerpc()
  1067:		sp := getcallersp()
  1068:		gp := getg()
  1069:		var docrash bool
  1070:		// Switch to the system stack to avoid any stack growth, which
(dlv) restart
Process restarted with PID 1905017
(dlv) continue
> main.main() ./last-character.go:11 (hits goroutine(1):1 total:1) (PC: 0x4984c5)
Warning: listing may not match stale executable
     6:	)
     7:	
     8:	func main() {
     9:		fmt.Println("Hello Gophers! Pass me a word and I will print the last character!")
    10:	
=>  11:		if len(os.Args) < 2 {
    12:			fmt.Println("You must supply an argument to this program")
    13:			os.Exit(1)
    14:		}
    15:	
    16:		arg := os.Args[1]
(dlv) next
> [unrecovered-panic] runtime.fatalpanic() /usr/local/go/src/runtime/panic.go:1065 (hits goroutine(1):1 total:1) (PC: 0x435080)
Warning: debugging optimized function
	runtime.curg._panic.arg: interface {}(string) "runtime error: index out of range [1] with length 1"
  1060:	// fatalpanic implements an unrecoverable panic. It is like fatalthrow, except
  1061:	// that if msgs != nil, fatalpanic also prints panic messages and decrements
  1062:	// runningPanicDefers once main is blocked from exiting.
  1063:	//
  1064:	//go:nosplit
=>1065:	func fatalpanic(msgs *_panic) {
  1066:		pc := getcallerpc()
  1067:		sp := getcallersp()
  1068:		gp := getg()
  1069:		var docrash bool
  1070:		// Switch to the system stack to avoid any stack growth, which
(dlv) rebuild
(dlv) clearall
Breakpoint 1 cleared at 0x4986c5 for main.main() ./last-character.go:11
(dlv) continue
(dlv) restart "debugging is so much fun!"
Process restarted with PID 1905914
(dlv) continue
> [unrecovered-panic] runtime.fatalpanic() /usr/local/go/src/runtime/panic.go:1065 (hits goroutine(1):1 total:1) (PC: 0x435080)
Warning: debugging optimized function
	runtime.curg._panic.arg: interface {}(string) "runtime error: index out of range [25] with length 25"
  1060:	// fatalpanic implements an unrecoverable panic. It is like fatalthrow, except
  1061:	// that if msgs != nil, fatalpanic also prints panic messages and decrements
  1062:	// runningPanicDefers once main is blocked from exiting.
  1063:	//
  1064:	//go:nosplit
=>1065:	func fatalpanic(msgs *_panic) {
  1066:		pc := getcallerpc()
  1067:		sp := getcallersp()
  1068:		gp := getg()
  1069:		var docrash bool
  1070:		// Switch to the system stack to avoid any stack growth, which
(dlv) stack
0  0x0000000000435080 in runtime.fatalpanic
   at /usr/local/go/src/runtime/panic.go:1065
1  0x00000000004348da in runtime.gopanic
   at /usr/local/go/src/runtime/panic.go:941
2  0x0000000000432aff in runtime.goPanicIndex
   at /usr/local/go/src/runtime/panic.go:89
3  0x0000000000498813 in main.main
   at ./last-character.go:18
4  0x00000000004373b8 in runtime.main
   at /usr/local/go/src/runtime/proc.go:250
5  0x0000000000461541 in runtime.goexit
   at /usr/local/go/src/runtime/asm_amd64.s:1571
(dlv) break last-character.go:18
Breakpoint 1 set at 0x49876f for main.main() ./last-character.go:18
(dlv) restart
Process restarted with PID 1906188
(dlv) continue
> main.main() ./last-character.go:18 (hits goroutine(1):1 total:1) (PC: 0x49876f)
    13:			os.Exit(1)
    14:		}
    15:	
    16:		arg := os.Args[1]
    17:	
=>  18:		fmt.Printf("The last character in that word is: %c\n", arg[len(arg)])
    19:	}
(dlv) print arg
"debugging is so much fun!"
(dlv) print len(arg)
25
(dlv) rebuild
(dlv) continue
> main.main() ./last-character.go:18 (hits goroutine(1):1 total:1) (PC: 0x49876f)
    13:			os.Exit(1)
    14:		}
    15:	
    16:		arg := os.Args[1]
    17:	
=>  18:		fmt.Printf("The last character in that word is: %c\n", arg[len(arg)-1])
    19:	}
(dlv) restart
Process restarted with PID 1907195
(dlv) clearall
Breakpoint 1 cleared at 0x49876f for main.main() ./last-character.go:18
(dlv) continue
(dlv) exit
